modules/vehicle/models/Booking.php

    public function carsMap()
    {
        return yii\helpers\ArrayHelper::map(Category::find()->where(['type_name' => 'car'])->all(), 'id', function ($model) {
            return $model->data_json['band'] .' ทะเบียน '.$model->data_json['car_regis'];
        });
---
SELECT * FROM `category` WHERE `type_name`='car'