modules/vehicle/views/default/_search.php

SELECT * FROM `category` WHERE `type_name`='car_type'
---
    'pluginOptions' => [
        'allowClear' => true
    ],
    'data' => ArrayHelper::map(Category::find()->where(['type_name' => 'car_type'])->all(), 'id', 'title'),