modules/vehicle/views/default/car_items.php

SELECT COUNT(*) FROM `booking` WHERE (`start` LIKE '2022-11-15') AND (`car_id`=8) AND (`status_id` <> 'cancel')
---
            <?php
            $start = explode(' ',$searchModel->start);
            // $bookingCount = Booking::find()->where(['like', 'start', $start[0] . '%', false])
            $bookingCount = Booking::find()->where(['like', 'start', $start[0], false])
            ->andWhere(['car_id' => $model->id])
            ->andWhere(['<>','status_id','cancel'])
            ->count();