modules/vehicle/controllers/BookingController.php

SELECT * FROM `booking` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Booking::findOne(['id' => $id])) !== null) {