modules/vehicle/views/booking/_form.php

/** @var yii\widgets\ActiveForm $form */

$car_id = isset($car_id) ? $car_id : $model->car->photo;
$car = Category::findOne($car_id);
---
SELECT * FROM `category` WHERE `id`=44

])->widget(Select2::classname(), [
    'options' => ['placeholder' => 'เลือกจังหวัด ...'],
    'disabled' =>$disable,
    'data' => ArrayHelper::map(Provinces::find()->all(), 'id', 'name_th'),
---
SELECT * FROM `provinces`