modules/usermanager/controllers/MeController.php

    protected function findModel()
    {
        if (($model = User::findOne(Yii::$app->user->id)) !== null) {
---
SELECT * FROM `user` WHERE `id`=2